# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIMacroManager..::..Dispose Method
UIMacroManager Class See Also
---
Releases all resources used by the UIMacroManager
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace